/* No comment provided by engineer. */
"(Hidden)" = "(Hidden)";

"(Offline)" = "(Offline)";

"Menu" = "Menu";

/* Permissions */
"Network Access" = "Network Access";
"Local Network Discovery" = "Local Network Discovery";
"WLED Native needs network access to communicate with your WLED devices over HTTP and WebSocket connections." = "WLED Native needs network access to communicate with your WLED devices over HTTP and WebSocket connections.";
"This permission allows the app to discover WLED devices on your local network using Bonjour/mDNS. Without this, you'll need to add devices manually." = "This permission allows the app to discover WLED devices on your local network using Bonjour/mDNS. Without this, you'll need to add devices manually.";
"Granted" = "Granted";
"Denied" = "Denied";
"Restricted" = "Restricted";
"Checking..." = "Checking...";

/* No comment provided by engineer. */
"(New Device)" = "(New Device)";

/* No comment provided by engineer. */
"Done" = "Done";

/* No comment provided by engineer. */
"Add New Device" = "Add New Device";

/* No comment provided by engineer. */
"Delete" = "Delete";

/* No comment provided by engineer. */
"Save" = "Save";

"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Edit" = "Edit";

/* No comment provided by engineer. */
"Edit Device" = "Edit Device";

/* No comment provided by engineer. */
"Manage Devices" = "Manage Devices";

/* No comment provided by engineer. */
"New Device" = "New Device";

/* No comment provided by engineer. */
"Refresh" = "Refresh";

/* No comment provided by engineer. */
"Pull to refresh" = "Pull to refresh";

/* No comment provided by engineer. */
"Show Hidden Devices" = "Show Hidden Devices";

"Hide Hidden Devices" = "Hide Hidden Devices";

"Show Offline Devices" = "Show Offline Devices";

"Hide Offline Devices" = "Hide Offline Devices";

"Turn On/Off" = "Turn On/Off";

"IP Address or URL" = "IP Address or URL";

"Custom Name" = "Custom Name";

"Hide this Device" = "Hide this Device";

"Online Devices" = "Online Devices";

"Offline Devices" = "Offline Devices";

"Select A Device" = "Select A Device";

"WLED Documentation" = "WLED Documentation";

"Controls" = "Controls";

"Settings" = "Settings";

"Update Channel" = "Update Channel";

"Stable" = "Stable";

"Beta" = "Beta";

"Your device is up to date" = "Your device is up to date";

"Version %@" = "Version %@";

"unknown_version" = "[unknown]";

"Check for Update" = "Check for Update";

"Checking for Updates" = "Checking for Updates";

"Update Available" = "Update Available";

"From %@ to %@" = "From %@ to %@";

"See Update" = "See Update";

"Skip This Version" = "Skip This Version";

"Are you sure?" = "Are you sure?";

"Install" = "Install";

"Install Now" = "Install Now";

"update_disclaimer" = "You are about to install a new version of WLED on your device. If you had a custom version installed previously, you might lose some functionalities (for example, if you had some usermods enabled, they might not work anymore). \n\nIf someone installed this device for you, you should maybe ask them if it is alright to update the device to a new version. \n\nWLED and WLED Native are not responsible if something goes wrong due to an update.";

"Updating %@" = "Updating %@";

"Starting Up" = "Starting Up";

"Please do not close the app or turn off the device." = "Please do not close the app or turn off the device.";

"No Compatible Version Found" = "No Compatible Version Found";

"no_compatible_version_details" = "No version that is compatible with your device could be found. You will need to manually update your device.";

"Downloading Version" = "Downloading Version";

"Installing Update" = "Installing Update";

"Update Completed!" = "Update Completed!";

"Update Failed" = "Update Failed";

"update_failed_details" = "Your device might be PIN protected or locked with a passphrase. Check your settings.";
